tap "homebrew/bundle"
tap "jetbrains/utils"
tap "jimeh/emacs-builds"
tap "kamillobinski/thock"
tap "xcodesorg/made"
brew "bash"
brew "fontconfig"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "openssl@3"
brew "dotnet"
brew "dprint"
brew "exercism"
brew "libyaml"
brew "fastlane"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "gradle"
brew "helix"
brew "imagemagick"
brew "jq"
brew "kotlin-language-server"
brew "ktlint"
brew "lazygit"
brew "lldpd"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "marksman"
brew "mkdocs"
brew "node"
brew "ollama"
brew "periphery"
brew "poppler"
brew "pyenv"
brew "raylib"
brew "rbenv"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "sevenzip"
brew "shellcheck"
brew "slides"
brew "sourcery"
brew "starship"
brew "stylua"
brew "swift-format"
brew "taplo"
brew "unar"
brew "vapor"
brew "xcode-build-server"
brew "yazi"
brew "zig"
brew "zls"
brew "zoxide"
brew "xcodesorg/made/xcodes"
cask "audacity"
cask "bruno"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono-nerd-font"
cask "jordanbaird-ice"
cask "linearmouse"
cask "localsend"
cask "pearcleaner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "swiftlang.swift-vscode"
vscode "vapor.vapor-vscode"
vscode "vscodevim.vim"
