tap "homebrew/bundle"
brew "bash"
brew "dotnet"
brew "exercism"
brew "fish"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "python@3.13"
brew "mkdocs"
brew "neovim"
brew "node"
brew "periphery"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "starship"
brew "stylua"
brew "xcode-build-server"
brew "zig"
cask "ghostty"
cask "pearcleaner"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "github.vscode-github-actions"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-xml"
vscode "sswg.swift-lang"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
