tap "homebrew/bundle"
tap "xcodesorg/made"
brew "bash"
brew "dotnet"
brew "dprint"
brew "exercism"
brew "fastlane"
brew "fish"
brew "gh"
brew "helix"
brew "kotlin-language-server"
brew "ktlint"
brew "lazygit"
brew "lldpd"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "marksman"
brew "python@3.13"
brew "mkdocs"
brew "neovim"
brew "node"
brew "ollama"
brew "periphery"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "slides"
brew "sourcery"
brew "starship"
brew "stylua"
brew "swift-format"
brew "xcode-build-server"
brew "zig"
brew "zls"
brew "xcodesorg/made/xcodes"
cask "font-zed-mono-nerd-font"
cask "ghostty"
cask "linearmouse"
cask "pearcleaner"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "github.vscode-github-actions"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.vscode-yaml"
vscode "sswg.swift-lang"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
